-- Вставляємо дані в таблицю faculties (факультети)
INSERT INTO faculties (name) VALUES 
('Факультет Інформатики'),
('Факультет Математики'),
('Факультет Фізики');

-- Вставляємо дані в таблицю groups (групи)
INSERT INTO groups (name, course, faculty_id) VALUES 
('ІТ-101', 1, 1),
('ІТ-102', 2, 1),
('МАТ-201', 1, 2),
('МАТ-202', 2, 2),
('ФІЗ-301', 3, 3);

-- Вставляємо дані в таблицю teachers (викладачі)
INSERT INTO teachers (name, department, faculty_id) VALUES 
('Іван Іванович', 'Кафедра Інформатики', 1),
('Марія Петрівна', 'Кафедра Математики', 2),
('Олександр Степанович', 'Кафедра Фізики', 3);

-- Вставляємо дані в таблицю subjects (предмети)
INSERT INTO subjects (name) VALUES 
('Програмування'),
('Математичний Аналіз'),
('Фізика');

-- Вставляємо дані в таблицю students (студенти)
INSERT INTO students (group_id, name, date_of_birth) VALUES 
(1, 'Петро Олександрович', '2003-06-15'),
(1, 'Олена Сергіївна', '2002-11-25'),
(2, 'Олексій Петрович', '2003-02-10'),
(3, 'Анна Іванівна', '2001-12-18'),
(4, 'Михайло Олексійович', '2000-09-30'),
(5, 'Катерина Андріївна', '2002-05-22');

-- Вставляємо дані в таблицю grades (оцінки)
INSERT INTO grades (student_id, subject_id, teacher_id, grade) VALUES 
(1, 1, 1, 85), -- Петро, Програмування, Іван Іванович
(1, 2, 2, 90), -- Петро, Математичний Аналіз, Марія Петрівна
(2, 1, 1, 88), -- Олена, Програмування, Іван Іванович
(3, 3, 3, 70), -- Олексій, Фізика, Олександр Степанович
(4, 2, 2, 92), -- Анна, Математичний Аналіз, Марія Петрівна
(5, 3, 3, 75), -- Михайло, Фізика, Олександр Степанович
(6, 1, 1, 80); -- Катерина, Програмування, Іван Іванович
